enum modal {
    BTN_LOGIN = 'ورود / ثبت نام',
    LOGIN = "ورود یا ثبت نام",
    TERMSCONDITIONS = "لطفا جهت ورود و یا ثبت نام در اپتیسان شماره همراه خود را وارد کنید. ثبت نام شما به منزله‌ی تایید قوانین و مقررات و همچنین حریم شخصی کاربران میباشد.",
    SUCCESS_POPUP = "تبریک! همکاری شما با اپتیسان شروع شد.با اپتیسان تجربه خریدی حرفه‌ای برای فروشگاه خود داشته باشید.",
    SUCCESS = "خوش امدید",
    PENDDING = ". . . درحال بررسی ",
    PENDDING_POPUP = "حساب کاربری شما ایجاد شده و توسط مدیریت اپتیسان در حال بررسی میباشد. در صورت تایید حساب کاربری برای شما پیامک ارسال خواهد شد.",
    REJECT = "عدم تایید",
    REJECT_POPUP = "درصورت اعتراض به دلایل ذکر شده به پشتیبانی مشتریان مراجعه کنید و درغیر اینصورت به تصحیح اطلاعات ارسالی بپردازید. ",
    REJECT_TITLE = " حساب کاربری شما به دلایل زیر رد شده است  :",
    REJECT_ITEM1 = "ناخوانا بودن مدارک شغلی ارسالی",
    REJECT_ITEM2 = "عدم هماهنگی رسته شغلی با پیج",
    REJECT_ITEM3 = "عدم ارسال جواز کسب",
    FORCE_BTN = "  صفحه جشنواره",
    FORCE_TITLE = "جشنواره فروش ویژه تابستانی",
    FORCE_SUBTITILE = " تا پایان ۹ مرداد ۱۴۰۳",
    SUBMIT_BTN = "تایید",
    SUPPORT_BTN = "پشتیبانی مشتریان",
    EDITACCOUNT_BTN = "ویرایش حساب",
    WELCOME = " خوش آمدید"
}
export default modal