import Header from "../../components/template/Header";
import Images from "../../components/ui/atoms/Image";
import conditionPic from "../../assets/images/service/contract.svg";
import "../../App.css";

export default function Conditions() {
  return (
    <div>
      <Header />
      <div className="flex flex-col w-full pt-24 px-12 gap-4 mobile:px-0 ">
        <div className="w-full flex items-center h-[fit-content] gap-2 mobile:justify-center mobile:mb-8">
          <div className="w-10 h-2 rounded-3xl bg-[#09A380] mobile:hidden"></div>
          <p className="text-[30px] mobile:text-[20px] font-bold">
            قوانین و شرایط
          </p>
          <p className="text-[30px] mobile:text-[20px] font-bold text-[#09A380]">
            ژینگه
          </p>
        </div>
      </div>
      <div className="w-full flex items-start mobile:flex-wrap no-scrollbar mobile:flex-col-reverse mobile:gap-12">
        <div className="w-[50%] h-[30rem] overflow-scroll no-scrollbar px-12 py-8 mobile:px-3 mobile:py-0 mobile:w-full">
          <div className="text-[16px] leading-relaxed text-start mobile:text-[15px]">
            1- با ورود به به سایت و اپلیکیشن ژینگه ، شما اعلام نموده اید که از
            کلیه شرایط و قوانین آگاه بوده و خود را ملزم به رعایت همه جانبه آنها
            می نمایید سایت و اپلیکیشن ژینگه بطور کل و جزء و در همه بخش ها مطابق
            با قوانین جمهوری اسلامی و ضوابط تجارت الکترونیک می باشد. 2- در سایت
            و اپلیکیشن ژینگه تمامی تلاش ما بر این است که اطلاعات وارد شده توسط
            مالکان، متقاضیان و مشاوران املاک بررسی و از صحت و سقم آنها اطمینان
            حاصل شود اما از آنجا که کلیه اطلاعات ورودی به این سامانه از جمله
            قیمت توسط کاربران صورت می گیرد لذا هیچ گونه تضمینی در رابطه با دقیق
            بودن این اطلاعات داده نمی شود به این وسیله کلیه مسولیت ها را از خوب
            سلب می نماییم. 3- قیمت گذاری املاک بر اساس نظر شخصی مالکان بوده و
            این سامانه هیچ گونه دخالتی در تعیین قیمت در بخشهای فروش، اجاره و رهن
            ندارد و هیچ گونه مسئولیتی را در این زمینه نمی پذیرد. 4- جهت استفاده
            از برخی امکانات سامانه نیاز به ثبت نام و ورود اطلاعات مربوطه می باشد
            و شما با دریافت نام کاربری تایید می کنید که اطلاعات را بصورت دقیق و
            واقعی ثبت کرده اید. در صورت ثبت ملک و تصاویر مربوطه متعهد می شوید که
            اطلاعات دقیق و تصاویر مطابق با قوانین جمهوری اسلامی ایران باشد و از
            ثبت هر گونه اطلاعات کذب و هر گونه اعمال مجرمانه و ارسال پیامهای
            نامربوط به سایر کاربران و هر نوع سوء استفاده اجتناب میکنید. 5- این
            سامانه خود را در حذف مطالب و اطلاعات و تصاویر کذب و خلاف قوانین و
            مقررات مجاز می داند. 6- هرگونه بازنشر، استفاده تجاری و تبلیغاتی از
            اطلاعات و سرویسهای ارائه شده در این سامانه بصورت جزئی و کلی بدون کسب
            مجوز رسمی، غیر قانونی و قابل پیگرد قضایی می باشد. 7- کلیه طرح ها،
            امکانات، کدهای نرم افزاری، گرافیک ها و پایگاه داده متعلق به این
            سامانه بوده و مشمول قوانین کپی رایت هستند. هرگونه استفاده و کپی
            برداری پیگرد قانونی دارد. 8- کلیه اطلاعات وارد شده توسط کاربران از
            جمله شماره تماس، ایمیل، اطلاعات ملک، اطلاعات آزانسهای مسکن و… در
            سرورهای امن این سامانه محفوظ می ماند و به هیچ عنوان در اختیار هیچ
            نهاد و شخص ثالثی قرار نخواهد گرفت. 9- قوانین و شرایط استفاده ذکر شده
            در این قسمت مشمول تغییر احتمالی در آینده است. لذا از شما درخواست
            میشود جهت اطلاع از آخرین تغییرات به صورت دوره ای این صفحه را مرور
            نمایید.
          </div>
        </div>
        <div className="w-[50%] flex justify-center items-start mobile:w-full">
          <Images
            src={conditionPic}
            alt="condition"
            width={"300px"}
            height={"400px"}
            className={"object-contain mobile:w-[200px] mobile:h-[300px]"}
          />
        </div>
      </div>
    </div>
  );
}
